{
"name": "Masturbate (Cock)",
"description": "Stroke your cock.",
"usage": "self",
"category": "Sex",
"distance_allowed": 0,
"message": [
	"<span class='purple'>%USER% grabs their own cock, slowly pumping their hand up and down its shaft.</span>",
	"<span class='purple'>%USER% jerks themself off!</span>",
	"<span class='purple'>%USER% grasps their own cock tightly as they rapidly jerk themself off!</span>",
	"<span class='purple'>%USER% squeezes beads of precum out of the tip of their own cock as they slowly run their hand up and down the shaft.</span>",
	"<span class='purple'>%USER% rubs the tip of their cock.</span>",
	"<span class='purple'>%USER% squeezes beads of precum out of the tip of their own cock as they run their hand up and down the shaft.</span>",
	"<span class='purple'>%USER% grabs their own cock, pumping their hand up and down its shaft.</span>",
	"<span class='purple'>%USER% grasps their own cock tightly as they jerk themself off!</span>",
	"<span class='purple'>%USER% grasps their own cock as they jerk themself off!</span>",
	"<span class='purple'>%USER% wraps a hand around their own cock, jerking themself off!</span>",
	"<span class='purple'>%USER% squeezes their own cock with their hand in a jerking motion.</span>",
	"<span class='purple'>%USER% gently rubs the tip of their cock.</span>",
	"<span class='purple'>%USER% slowly rubs the tip of their cock.</span>",
	"<span class='purple'>%USER% grasps their own cock as they slowly jerk themself off!</span>",
	"<span class='purple'>%USER% squeezes beads of precum out of the tip of their own cock as they pump their hand up and down the shaft.</span>",
	"<span class='purple'>%USER% wraps a hand around their own cock, vigorously jerking themself off!</span>"
],
"user_messages": [
	"<span class='purple'>Your cock twitches as it's rubbed and squeezed by your own hand.</span>",
	"<span class='purple'>Your cock throbs as it's rubbed and squeezed by your own hand.</span>",
	"<span class='purple'>You jerk yourself off!</span>",
	"<span class='purple'>You squeeze beads of precum out of the tip of your cock as you run your hand up and down the shaft.</span>",
	"<span class='purple'>You grab your cock, pumping your hand up and down its shaft.</span>",
	"<span class='purple'>You grasp your own cock as you jerk yourself off!</span>",
	"<span class='purple'>You wrap a hand around your cock, vigorously jerking yourself off!</span>",
	"<span class='purple'>You squeeze beads of precum out of the tip of your cock as you slowly run your hand up and down the shaft.</span>",
	"<span class='purple'>You grasp your own cock tightly as you rapidly jerk yourself off!</span>",
	"<span class='purple'>You squeeze beads of precum out of the tip of your cock as you pump your hand up and down the shaft.</span>",
	"<span class='purple'>You rub the tip of your cock.</span>",
	"<span class='purple'>You wrap a hand around your cock, jerking yourself off!</span>"
],
"user_required_parts": [
	"penis"
],
"interaction_requires": [
	"self_hand"
	],
"user_pleasure": 3,
"user_arousal": 5,
"lewd": 1,
"color": "pink"
}
